Autodesk.Revit.DB.PointClouds.PointCloudEngineRegistry.RegisterPointCloudEngine(System.String,Autodesk.Revit.DB.PointClouds.IPointCloudEngine,System.Boolean)
Registers a new point cloud engine and associates it to a particular file extension.
identifier:
A string that distinguishes the engine being registered.  If isFileBased is true,
this should be the file extension (e.g. "rcs" or "rcp").  If isFileBased is false, this
identifier is used only by API calls and should be unique.
engine:
The point cloud engine that governs point clouds matching the input identifier.
isFileBased:
Indicates to Revit if a single Point Cloud corresponds to a single file on disk.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The same identifier has already been registered by another engine.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012